CSI API ETABS v1

# cAreaObjSetSelectedEdge Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetSelectedEdge(
    	string Name,
    	int EdgeNum,
    	bool Selected
    )

    Function SetSelectedEdge (
    	Name As String,
    	EdgeNum As Integer,
    	Selected As Boolean
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim EdgeNum As Integer
    Dim Selected As Boolean
    Dim returnValue As Integer

    returnValue = instance.SetSelectedEdge(Name,
    	EdgeNum, Selected)

    int SetSelectedEdge(
    	String^ Name,
    	int EdgeNum,
    	bool Selected
    )

    abstract SetSelectedEdge :
            Name : string *
            EdgeNum : int *
            Selected : bool -> int

#### Parameters

Name

    Type: SystemString

EdgeNum

    Type: SystemInt32

Selected

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com